{
  projects =
  [
    {
      "title": "Javelin E-Scooter",
      "link": "escooter",
      "cover": "scooter_cover.png",
      "description": "This is a custom electric scooter built to be as compact as possible while still being usable for short to medium distance commutes. It was built over around 7 months from sketchbook to test rides with a budget of $1k.%%The scooter undergoing trials in Feburary,20250218_170548.jpg%%There seems to be an plague of electric scooters sweeping across university campuses lately, or at least that's the case at Stony Brook. Seeing this, I decided to join in and use a scooter for my mobility needs. More specifically, I needed a way to get from where I was living to campus about 2.5 miles away and it was ideally very portable and fast. Commericial products seemed to only ever check two out of three of those boxes, so I decided to design one to check all the boxes.%%The CAD of the scooter,scooterDesign.png%% The design of the scooter heavily borrows from my combat robot experience, being aluminum sheet metal joined with nutstrips so I can order the parts from <a href=\"https://sendcutsend.com/\">SendCutSend</a> for relatively cheap. The most ambitious design element is the folding deck which was required to minimize the size of the scooter when folded. The stem of the scooter also folds down into thirds and then folds down onto the deck. %%b%%With the main design finalized, I calculated my final cost to be about $995, ever so slightly below budget. %%Specifications,h%% Before committing to the design, I did a lot of market research into existing compact scooter designs. Now that I am writing this in retrospect, I can compare the data gathered from test runs against the specifications of those other scooters.%%b%% A good portion of the designs, especially those at the smallest end of folded volume, were either early or limited crowdfunding campaigns or discontinued products. Shown below are the physical specifications of my scooter compared with 10 other scooters. The raw data and sources can be found <a href=\"https://docs.google.com/spreadsheets/d/1f_MRLitBwHNer3pAdbpCN1bQak1OpVClRnMCl3yneUM/edit?usp=sharing\">here</a>.%%b%%<br/> %%A comparison of volume and weight of my scooter against other similar products,techSpecs.png%% Although the folded volume is not a great measure of compactness as a longer scooter will have the same volume as a shorter but taller scooter even when the shorter scooter may be more compact in typical use. However, it still provides a reasonable estimate of the size of my scooter.%%b%% The performance in terms of range and top speed can also be compared, although the max speed is a conservative estimate based on the new battery upgrade and the 40kph obtained with the current battery setup. %%b%%<br/>%%A comparison of range and top speed of my scooter against other similar products,perfSpecs.png%% The range is superior or the same as all the listed scooters except the non-midfolding scooters. Meanwhile the speed is superior to all similar scooters. Note that the top speed was not achieved during the same trial as the range trial. %%Stem highlighted on the CAD,stemMountStem.png%% Starting with the stem and stem holder, shown in blue and turqoiuse respectively, this was the component which needed the most prototyping. My initial design for the upper portion of the stem was quite different from the final iteration. I was worried that a tube-based stem would be too finicky to fold and wouldn't save enough room. Thus, I came up with a alternate design using an aluminum L extrusions and sheet metal which can collapse outwards.%%20241214-2202-42.3956893.mp4%% This design did turn out to be extremely compact and easy to use, however it was about as rigid as a wet noodle when it came to actually twisting the handle to steer. I went back to the drawing board and came up with the current design which would fold into thirds and just barely left enough room for the stem fold down. This design actually turned out to be even more compact with a greater unfolded height as well.%%Old and new stem design,stemDesign.png%%With the design finalized, I started with machining the series of aluminum tubes. The large tube which the stem sits inside was sawed down to size and cleaned up on my lathe, then inserted into two CNC spindle holders. %%The stem tube being machined,stem.png%%The stem itself was harder to make as I didn't have a 4 axis mill to drill the holes in the tube. Instead, I used the next best thing, a 3D-printed jig with a drill guide which perfectly sits on top of the jig.%%The stem being drilled and the drill jig,drillJig.png%% With this new design, I quickly discovered the hook on the latch was not strong enough and would bend when I accelerated too quickly. To fix this, I would need to make a hook made without sheet metal bending, which was outside of my capabilities. Fortunately, my friend happened to be working on his own CNC mill, so I sent the part over and waited. %%A comaprison of the old and new hook,hook.png%%The carry handle was created by hand once the rest of the stem was assembled. The brackets were cut out from an old steel combat robot top plate and the rest of the handle was modeled and printed afterwards.%%The brackets and handle,carryHandle.png%% %%Deck highlighted on the CAD,deck.png%%The deck is the core of this design as it was the limiting factor in how small I could make it. Looking around at commericial or even weird one-off designs that never made it to production, I decided to attempt a feature which as far as I can tell, only a small handful of scooters have attempted: a folding deck. My solution was the simpliest implementation, spliting the deck right down the middle. This way I could take advantage of having identical front and rear panels and save some money through the SendCutSend volume discount. Two hinges and two latches would attach the two deck halves together and I made sure every component in this critical assembly would be able to hold up to the forces with a very large margin of safety. In order to save some weight without impacting performance, the frame rails were topology optimized using Inventor's built-in shape generator. %%b%%As the pieces of the deck were already cut and bent by SendCutSend, all I had to do was put the pieces together. I used #10-24 screws with <a href=\"https://www.fingertechrobotics.com/proddetail.php?prod=ft-nutstrip\">nutstrips</a> to join the panels at 90 degree angles.%%Putting the two segments of the deck together,deckAssemble.png%% %%Drive pod highlighted on the CAD,drivePod.png%% The drive pod was the most complex component to put together due to the many fast moving parts. The sprockets for the chain reduction were cut by SendCutSend too, but needed bevels added to the teeth. This was done by attaching them to a hand drill and spinning the sprockets against a belt sander. The chain drive could then be fully assembled. %%20250105_200744.mp4%% A plastic spacer was then pressed onto the rear wheel allowing nine 1/4\" bolts to attach the large sprocket to the wheel. The smaller sprocket was then attached to the motor using four high-load M3 screws and another 3D-printed spacer with a stepped aluminum shaft I made on my lathe. The motor could then be bolted to the aluminum panels and the wheel mounted on a 8mm shaft. %%The wheel being mounted to the drive pod,drivePodAssem.png%% %%Electronics highlighted on the CAD,electronicsBanner.png%%The electrical system of the scooter is only comprised of three main components, the battery, the switch, and the speed controller. For the latter two, I repurposed parts not typically meant for an electric land vehicle. The switch was intended as a battery disconnect for a boat, and thus was well suited for the high current loads the motor was drawing. The speed controller was a large 150 Amp ESC meant for airplanes, thus extremely compact for the power output. %%Main switch and full electrical system,electronics.png%% These components would take up the majority of the space inside the deck of the scooter. The battery lives inside a large compliant TPU sleeve inside the forward half of the deck. The sleeve was the largest TPU print I had ever done, measuring almost a foot long. The switch and the speed controller lives in the other half of the deck in custom enclosures designed to mount to the nutstrips inside the frame. A cable sleeve connected the two halves such that the scooter could fold and unfold without damaging the wiring.%%The three aforementioned housings for the electrical components,electronicsComponents.png%% In addition to the major components, a couple peripherals would allow me to control the scooter. An Arduino Nano powered by a BEC would interpret the signal from a throttle mounted on the handlebars and feed that to the speed controller. This would also let me later do throttle smoothing and potentially implement other smart features like having current and voltage feedback. This all fits into a small box sitting next to the main switch.%%The box which holds the Arduino,arduinoEnclosure.png%% For the throttle, I originally tried to design my own using a 3D-printed TPU spring inside something that was supposed to resemble a ship's helm. This showed early promise and I learned a lot about designing 3D-printed springs. However the final product would sometimes get stuck which would be dangerous, and the design was dropped for an off-the-shelf throttle for a different scooter.%%%% This would still involve some challenges, mainly shutting off the throttle whenever the brake was pressed. I solved this with an old spare limit switch from a 3D-printer. This was set up such that the throttle would only send a signal if the limit switch was pressed, which would only be when the brake was not engaged. %%The brake limit switch mounted on the brake handle,20250315_011224.jpg%% %%Cooling system highlighted on the CAD,coolingSystem.png%% After a couple simple tests going back and forth, it became apparent that there was a significant thermal issue with the motor. It would get too hot to touch within minutes of high load running. It was too late to consider a different motor, so I devised a cooling system using heat pipes which would transfer heat from a copper plate backing the motor to two large aluminum heatsinks above the drive pod.%%Cooling system highlighted in green,Screenshot 2025-12-28 154700.png%%The copper plate was cut using a hacksaw and a lot of patience with a hand file. A bit of solder was used to reinforce a weak spot via blowtorch. I designed a custom 3D-printed tool to bend the heat pipes without damaging them. The bent pipes then fit into the matching cutouts on the copper plate. %%The copper plate and heat pipes being bent,copperPlate.png%%The heatsink assembly was contructed from two off-the-shelf heatsinks bolted to a larger copper plate with similar cutouts for the ends of the heat pipes. %%The making of the heatsink and integration,heatsink.png%% Thermal paste was used to ensure good thermal contact between every surface and aluminum supports were added to hold the heatsink in place."
    },
    {
      "title": "Combat Robot",
      "link": "2",
      "cover": "cr_cover.png",
      "description": "This is a 12 lb combat robot named YOB TROHS (SHORT BOY spelled backwards). It was designed to compete in the National Havoc Robot League (NHRL) and built from scratch over 5 months.%%The official photo of the robot,yobtrohs-removebg.png%%As a long-time BattleBots fan, I have always wanted to build a combat robot. I spearheaded this project and assembled a team with friends from my school's Robotics team to design, build, and then compete with a full 12 lb robot from scratch. The goal is not only to gain experience with hands-on robotics but also to initiate and establish a new activity for people into robotics in the community.%%My competitor pass,PXL_20230930_033659876 1.png%%The majority of the time was spent on designing the bot. Onshape was the design software of choice for its collaborative features, and the final design is viewable <a href=\"https://cad.onshape.com/documents/38bad504d3484345ac6cf3a3/w/e066d07a8376ce05bc1f1825/e/37c417fcdb0c41031a4f98ad\">here</a>.%%b%%I organized the design of the robot, it was one of the largest and most detailed assemblies I had ever created, with every screw and bolt represented. At major versions, I reached out to members of the NHRL community to review our design and communicated what needed to change to the rest of the team. The robot was given the name \"YOB TROHS\" after someone compared the design as a short version of <a href=\"https://wiki.nhrl.io/wiki/index.php/YOB_GNOL\">YOB GNOL</a>.%%The finished CAD of the robot,Screenshot 2023-10-21 232941.png%%The components were mostly manufactured in-house. I worked on printing everything we needed, and I learned how to print with exotic filaments like carbon-fiber nylon and TPU for their special properties. Most of the aluminum and AR500 parts were cut by SendCutSend. Other parts were cut in the high school machine shop. Complex parts were made on the lathe and mill, and I learned how to operate the plasma cutter to make the armor.%%20230802_163935.mp4%%I also worked on the electronics and code. I soldered all the connectors and joints inside the robot. To translate the controller inputs into our motors, I used an Arduino nano microcontroller and wrote some basic code.%%My first attempts at soldering connectors,connectors.png%% %%20230923_151814.mp4%%As the target event approached, our combat robot YOB TROHS was put together for the first time and was finally tested.%%The nearly complete robot on my workbench,20230924_132955.jpg%% %%20230927_213747.mp4%%On the day before the competition, I traveled to the event to finalize the robot before the mandatory safety inspection. YOB TROHS passed safety at a weight of 11.98 lbs, barely making the 12 lb cut-off.%%Barely weighing in,20230930_075604.jpg%%Many last-minute surprises and fixes awaited us. During one of our tests, the weapon hit its own pulley and exploded, so we were forced to go into our first fight without a weapon. Our first match was Whomper, a terrifying horizontal spinner. The results were not good, Whomper had bent one of the frame sides, bending the gearbox axle underneath.%%b%%The builder community is a very friendly environment, and we got tips from many of the other competitors after the match. To repair our robot, I took the bent parts to the competitor machine shop and bent most of the components back into a usable shape with a press. The second match was against Darkstar. The newly-repaired YOB TROHS went the whole 3 minutes and managed to engage Darkstar properly.%%20230930_144334.mp4%%After the event, we took a break to focus on the FRC team we were a part of. In late April, we had a lot more time on our hands and began upgrades in preparation for another run. From the first event, mobility and weapon reliability were the primary problems we encountered. We solved the mobility issue with some slippery sliders in the front and cleats on the wheels to grip into the wood floor.%%UHMW slider blocks on the front of the robot,20240530_201429.jpg%%The sliders were milled from UHMW and bolted where the front wheels should have been to stop the wedge from scraping againt the ground.%%steel cleats on the rear wheels,20240616_224635.jpg%%The cleats were cut by SendCutSend again and directly pressed onto the hex shaft next to the wheel. I also decided to lower the drive reduction so the robot would drive faster.%%b%%As fro the weapon upgrades, the old weapon had a problem where the pulley on the motor side kept sliding off. A new motor was swapped in and the pulley was custom machined to fit.%%Both of the weapon upgrades,motor.png%%The drive upgrades were definitely a vast improvement with the weapon upgrade being somewhat more mixed. We participated in the next event as soon as the robot was ready which ended up being in June of 2024. Unfortunately, our match-ups were not great. We were up against Minor Threat V, a regular championship finalist, and Downpour, a well-established competitor. The robot performed admirably against these odds, but both ended in knockouts for us.%%The final state of the robot post-event,IMG_6425.jpg%%The frame of the robot was a lot more chewed up than the last event and ultimately we decided that this would be YOB's last event. We had learned a lot from our first robot, and we have many ideas for a completely new design. A silver lining was that the internal components were in pristine condition, and these will hopefully make their way into the next robot."

    },
    {
      "title": "Differential Swerve",
      "link": "3",
      "cover": "ds_cover.png",
      "description": "This is a series of experimental swerve drives designed for combat robotics implementing differential swerve and shuffler technology. The ultimate goal would be to mount this on a new robot for NHRL combat robotics.%%b%%<iframe height=\"300\" src=\"https://www.youtube.com/embed/moCGVyodcd4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe> %%A demonstration of forwards drive in CAD,DSS-example.gif%%I wanted to develop a new swerve drive system for combat robotics, something that I feel had not been fully explored yet. With my experience from building a differential swerve drive in 10th grade, I created a new version 2 with updated mechanics. While keeping the omni-directional movement and power of a differential swerve drive, I integrated a walking shuffler mechanism to replace the wheel. The benefit is two-fold: allowing the robot to take advantage of the \"Non-Traditional (wheel-less) Locomotion\" weight bonus offered by NHRL, as well as being able to fit in a much narrower profile compared to a wheel. Both direction and speed of each swerve module is controlled via the turning of two large ring gears. When the two gears rotate in opposite directions, the module moves forwards. When in the same direction, the entire module changes direction with it. Shown below is a demonstration of turning and moving forward using an unassembled drive.%%20240501_213927.mp4%%The shuffler system uses a series of mechanical cams mounted on a center axle to produce an approximation of walking. The version mounted inside the swerve drive was designed to fit a tall and narrow profile, shown below is an early proof-of-concept prototype.%%An early prototype,PXL_20240205_032522712.jpg%%This combination of concepts was (as far as I could find) not something which had been built before. The design of V2 was similar to my first differential-swerve attempt with the 3D-printed construction. However, it is under half of the width and actually outfitted with a full set of electronics. Two 2216 BLDC motors drive the module and a magnetic encoder detects the angle it is currently pointed.%%b%%Originally, I had also planned for a 3D-printed gearbox to serve as the 5:1 ratio the motors needed in order to provide enough torque. While the gearboxes worked, it quickly became apparent that there was a durability issue. First, the modules were melting themselves, so I turned out some brass bearings and tried higher temperature filaments. This extended the time they lasted, but not nearly enough. Not wanting to deal with another potential point of failure, I shelved the custom gearbox for now.%%20240301_203610.mp4%%Making the control code for this project was something completely new to me. I used an Arduino Mega microcontroller for its number of ports. The solution I came to was to set the base speed of the two motors to the throttle value and then use PID to speed up or slow down each individual motor such that the module rotates towards a target angle.%%20240401_223855.mp4%%With a functional design, I manufactured a second module and started working on the frame of a robot I could mount them to. The robot is constructed from plasma-cut mild steel panels held together with nutstrips.%%The second swerve drive and frame,swerveDrives.png%%To replace the 3D-printed gearboxes, I bought some cheap gearboxes which came with their own pinion. However, I needed to reduce the diameter of the motor shaft to press the pinion onto it, and to remove the motor shaft I used a lighter to heat up the casing. Then I used the lathe to turn the shaft down until the pinion could be pressed on and gearbox attached.%%The shaft being removed and then fitted into the gearbox,pinion.png%%To fulfill the active weapon requirement, I designed a waggle stick using a brushed motor with a 130:1 reduction. The stick itself is a piece of bent 1/4\" chromoly from SendCutSend. %%Finished construction of the waggle stick,waggleStick.png%% %%20240617_214011.mp4%% Testing the swerve drive units on the ground produced mixed results. They would work in moving the robot around, but were very unreliable and would only go in the desired direction half the time. %%20240615_221643.mp4%% Unfortunately, there was no time left for this version of the robot, as the NHRL event was only a few days away. This ultimately resulted in the robot not passing safety and not competing due to the unreliable drive. I spent most of the event modifying code and fixing the swerves when they broke during testing. It was also apparent that the design itself was flawed. Fixing the drives took way too much time. Accessing or removing any part of the drive involved taking apart the entire module. The construction was also overall too tall, leading the robot to almost exceed the weight limit. %%b%% When I got back, I started thinking about a complete redesign using the lessons I learned. This V3 design would aim to use the same parts as V2 but be half the size in terms of height, have an assembly that entirely disassembles with a couple screws, and better reliability. Minimizing the size was the greatest challenge. The first innovation was to reorient the motors horizontally and use a stepped bevel gear as the ring gear. This eliminated the limiting factor on the height of the module and also let the motors be directly removable from the frame without disassembling the rest of the assembly.%%The gears of the new design.,Screenshot 2026-01-02 171727.png%%The encoder gear was also repositioned from the top of the module to the center to save a bit of additional space. The 1:1 output gearing for the encoder was kept but instead of the large output gear, a chain of smaller gears achieved the same gearing in a much more compact package. Note how the gear under the green encoder rotates at the same angular speed the module does.%%Screen Recording 2026-01-02 173103.mp4%%Although this design started with shufflers, with this much weight and size savings, I was also able to return to a wheeled robot. I noticed that one of the problems with V2 was the shufflers causing the robot to bounce around which potentially led to something breaking. In order to fit a wheeled system into the tall cylindrical space where the shufflers were, I designed a belted arrangement where a tread would tranfer torque while also being the surface that contacts the ground. %%20241227_115159.mp4%%This change would also help with simplifying the construction. Now without the long shuffler legs in the way, simply removing four M3 bolts which hold the top and bottom halves of the outer shell separates the halves and allows easy access to all the internals. %%Storyboard1.mp4%% The final V3 design is very promising and may finally make its way into a competitive robot. Since the initial build of the first V3 drive unit, this project has taken a backseat to my <a href=\"./projects.html?proj=escooter\">electric scooter project</a>. However, as that project and its upgrades wrap up, I am looking to start development of this diffy swerve once again. %%V1 to V3 of the swerve drive,diffy.png%%"
    },
    {
      "title": "SMA Research",
      "link": "4",
      "cover": "scooter_cover.png",
      "description": "description for project 4"
    },
    {
      "title": "project 5",
      "link": "5",
      "cover": "scooter_cover.png",
      "description": "description for project 5"
    }
  ]
}